cavity_100_movingVANS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (2 0 0)
    (2  0.3 0)
    (0 0.3 0)

    (0 0 0.08)
    (2 0 0.08)
    (2  0.3 0.08)
    (0 0.3 0.08)

    (0 1 0)
    (2 1 0)
    (0 1 0.08)
    (2 1 0.08)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 30 4) simpleGrading (1 0.1 1)
    hex (3 2 9 8 7 6 11 10) (100 70 4 ) simpleGrading (1 10 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
		(8 9 11 10)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (1 2 5 6)
            (2 9 11 6)
            (0 3 7 4)
            (3 8 10 7)
        );
    }
	back
	{
	     	type cyclic;
	       	neighbourPatch  front;

		faces
		(
            (4 5 6 7)
            (7 6 11 10)
		);
	}
	front
	{
		 	type cyclic;
		   	neighbourPatch  back;

		    faces
		    (
            (0 1 2 3)
            (3 2 9 8)
		    );
	}
   
);

mergePatchPairs
(
);

// ************************************************************************* //
