cavity_100_movingVANS/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       109200;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       109600;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          10000;
        startFace       110800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          10000;
        startFace       120800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
)

// ************************************************************************* //
