cavity_100_movingVANS/constant/porousSolidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porousSolidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Cd               1.;
rhob             1.;
rhos           100.;
porosity        0.8;
nh                6;
Nhair             2;
Nchild            2; //must be even
Lx               2.;
Ly               1.;
H               0.3;
B_bending         0.000001;


// ************************************************************************* //
